rank = {'جندي':1, 'عريف':2, 'رقيب':3, 'رقيب أول':4, 'مساعد':5, 'مساعد أول':6, 'ملازم':7, 'ملازم أول':8, 'نقيب':9, 'رائد':10, 'رائد أح':11, 'مقدم':12, 'مقدم أح':13, 'عقيد':14, 'عقيد أح':15, 'عميد':16, 'عميد أح':17, 'لواء':18, 'لواء أح':19}

residence = { 'القاهرة', 'الإسكندرية', 'الجيزة', 'الشرقية', 'الدقهلية', 'المنوفية', 'البحيرة', 'القليوبية', 'الغربية', 'كفر الشيخ', 'الشرقية', 'بورسعيد', 'الإسماعيلية', 'السويس', 'الشمالية', 'البحر الأحمر', 'سوهاج', 'قنا', 'الأقصر', 'أسوان', 'الوادي الجديد', 'المنيا', 'بني سويف', 'الفيوم', 'أسيوط', 'سوهاج', 'مطروح'}

# سرية
brigade = {}

state = {'present', 'absent', 'errand'}
